; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-22-20)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 - object)
(:init
(at-robby robot1 room10)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room20)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room17)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room22)
(at ball2 room11)
(at ball3 room15)
(at ball4 room17)
(at ball5 room17)
(at ball6 room5)
(at ball7 room1)
(at ball8 room8)
(at ball9 room7)
(at ball10 room16)
(at ball11 room14)
(at ball12 room20)
(at ball13 room21)
(at ball14 room4)
(at ball15 room13)
(at ball16 room18)
(at ball17 room6)
(at ball18 room9)
(at ball19 room13)
(at ball20 room17)
)
(:goal
(and
(at ball1 room1)
(at ball2 room4)
(at ball3 room20)
(at ball4 room20)
(at ball5 room10)
(at ball6 room21)
(at ball7 room12)
(at ball8 room19)
(at ball9 room8)
(at ball10 room9)
(at ball11 room13)
(at ball12 room7)
(at ball13 room20)
(at ball14 room6)
(at ball15 room2)
(at ball16 room14)
(at ball17 room10)
(at ball18 room2)
(at ball19 room22)
(at ball20 room17)
)
)
)

; plan
1. (pick robot3 ball5 room17 lgripper3)
   deleted: (at ball5 room17) (free robot3 lgripper3)
   added: (carry robot3 ball5 lgripper3)
   goals met: 1 of 20
2. (pick robot3 ball4 room17 rgripper3)
   deleted: (at ball4 room17) (free robot3 rgripper3)
   added: (carry robot3 ball4 rgripper3)
   goals met: 1 of 20
3. (pick robot2 ball12 room20 lgripper2)
   deleted: (at ball12 room20) (free robot2 lgripper2)
   added: (carry robot2 ball12 lgripper2)
   goals met: 1 of 20
4. (move robot1 room10 room9)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room9)
   goals met: 1 of 20
5. (move robot3 room17 room20)
   deleted: (at-robby robot3 room17)
   added: (at-robby robot3 room20)
   goals met: 1 of 20
6. (move robot2 room20 room7)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room7)
   goals met: 1 of 20
7. (pick robot1 ball18 room9 lgripper1)
   deleted: (at ball18 room9) (free robot1 lgripper1)
   added: (carry robot1 ball18 lgripper1)
   goals met: 1 of 20
8. (drop robot3 ball4 room20 rgripper3)
   deleted: (carry robot3 ball4 rgripper3)
   added: (at ball4 room20) (free robot3 rgripper3)
   goals met: 2 of 20
9. (drop robot2 ball12 room7 lgripper2)
   deleted: (carry robot2 ball12 lgripper2)
   added: (at ball12 room7) (free robot2 lgripper2)
   goals met: 3 of 20
10. (pick robot2 ball9 room7 rgripper2)
   deleted: (at ball9 room7) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 3 of 20
11. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 3 of 20
12. (move robot3 room20 room10)
   deleted: (at-robby robot3 room20)
   added: (at-robby robot3 room10)
   goals met: 3 of 20
13. (move robot2 room7 room8)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room8)
   goals met: 3 of 20
14. (move robot1 room6 room2)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room2)
   goals met: 3 of 20
15. (drop robot3 ball5 room10 lgripper3)
   deleted: (carry robot3 ball5 lgripper3)
   added: (at ball5 room10) (free robot3 lgripper3)
   goals met: 4 of 20
16. (drop robot2 ball9 room8 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room8) (free robot2 rgripper2)
   goals met: 5 of 20
17. (pick robot2 ball8 room8 lgripper2)
   deleted: (at ball8 room8) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 5 of 20
18. (drop robot1 ball18 room2 lgripper1)
   deleted: (carry robot1 ball18 lgripper1)
   added: (at ball18 room2) (free robot1 lgripper1)
   goals met: 6 of 20
19. (move robot2 room8 room19)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room19)
   goals met: 6 of 20
20. (move robot3 room10 room16)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room16)
   goals met: 6 of 20
21. (move robot1 room2 room15)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room15)
   goals met: 6 of 20
22. (drop robot2 ball8 room19 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room19) (free robot2 lgripper2)
   goals met: 7 of 20
23. (pick robot3 ball10 room16 lgripper3)
   deleted: (at ball10 room16) (free robot3 lgripper3)
   added: (carry robot3 ball10 lgripper3)
   goals met: 7 of 20
24. (pick robot1 ball3 room15 lgripper1)
   deleted: (at ball3 room15) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 7 of 20
25. (move robot3 room16 room9)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room9)
   goals met: 7 of 20
26. (move robot1 room15 room6)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room6)
   goals met: 7 of 20
27. (move robot2 room19 room6)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room6)
   goals met: 7 of 20
28. (drop robot3 ball10 room9 lgripper3)
   deleted: (carry robot3 ball10 lgripper3)
   added: (at ball10 room9) (free robot3 lgripper3)
   goals met: 8 of 20
29. (pick robot1 ball17 room6 rgripper1)
   deleted: (at ball17 room6) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 8 of 20
30. (move robot2 room6 room5)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room5)
   goals met: 8 of 20
31. (move robot1 room6 room20)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room20)
   goals met: 8 of 20
32. (move robot3 room9 room6)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room6)
   goals met: 8 of 20
33. (pick robot2 ball6 room5 lgripper2)
   deleted: (at ball6 room5) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 8 of 20
34. (move robot3 room6 room4)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room4)
   goals met: 8 of 20
35. (drop robot1 ball3 room20 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room20) (free robot1 lgripper1)
   goals met: 9 of 20
36. (move robot2 room5 room21)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room21)
   goals met: 9 of 20
37. (move robot1 room20 room10)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room10)
   goals met: 9 of 20
38. (drop robot2 ball6 room21 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room21) (free robot2 lgripper2)
   goals met: 10 of 20
39. (pick robot2 ball13 room21 rgripper2)
   deleted: (at ball13 room21) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 10 of 20
40. (pick robot3 ball14 room4 lgripper3)
   deleted: (at ball14 room4) (free robot3 lgripper3)
   added: (carry robot3 ball14 lgripper3)
   goals met: 10 of 20
41. (drop robot1 ball17 room10 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room10) (free robot1 rgripper1)
   goals met: 11 of 20
42. (move robot2 room21 room20)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room20)
   goals met: 11 of 20
43. (move robot3 room4 room6)
   deleted: (at-robby robot3 room4)
   added: (at-robby robot3 room6)
   goals met: 11 of 20
44. (drop robot2 ball13 room20 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room20) (free robot2 rgripper2)
   goals met: 12 of 20
45. (drop robot3 ball14 room6 lgripper3)
   deleted: (carry robot3 ball14 lgripper3)
   added: (at ball14 room6) (free robot3 lgripper3)
   goals met: 13 of 20
46. (move robot1 room10 room11)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room11)
   goals met: 13 of 20
47. (pick robot1 ball2 room11 lgripper1)
   deleted: (at ball2 room11) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 13 of 20
48. (move robot2 room20 room22)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room22)
   goals met: 13 of 20
49. (move robot3 room6 room22)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room22)
   goals met: 13 of 20
50. (move robot1 room11 room4)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room4)
   goals met: 13 of 20
51. (pick robot2 ball1 room22 lgripper2)
   deleted: (at ball1 room22) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 13 of 20
52. (move robot3 room22 room2)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room2)
   goals met: 13 of 20
53. (drop robot1 ball2 room4 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room4) (free robot1 lgripper1)
   goals met: 14 of 20
54. (move robot2 room22 room1)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room1)
   goals met: 14 of 20
55. (move robot3 room2 room22)
   deleted: (at-robby robot3 room2)
   added: (at-robby robot3 room22)
   goals met: 14 of 20
56. (drop robot2 ball1 room1 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room1) (free robot2 lgripper2)
   goals met: 15 of 20
57. (pick robot2 ball7 room1 rgripper2)
   deleted: (at ball7 room1) (free robot2 rgripper2)
   added: (carry robot2 ball7 rgripper2)
   goals met: 15 of 20
58. (move robot1 room4 room18)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room18)
   goals met: 15 of 20
59. (move robot3 room22 room14)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room14)
   goals met: 15 of 20
60. (pick robot1 ball16 room18 lgripper1)
   deleted: (at ball16 room18) (free robot1 lgripper1)
   added: (carry robot1 ball16 lgripper1)
   goals met: 15 of 20
61. (pick robot3 ball11 room14 lgripper3)
   deleted: (at ball11 room14) (free robot3 lgripper3)
   added: (carry robot3 ball11 lgripper3)
   goals met: 15 of 20
62. (move robot2 room1 room12)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room12)
   goals met: 15 of 20
63. (drop robot2 ball7 room12 rgripper2)
   deleted: (carry robot2 ball7 rgripper2)
   added: (at ball7 room12) (free robot2 rgripper2)
   goals met: 16 of 20
64. (move robot1 room18 room14)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room14)
   goals met: 16 of 20
65. (move robot3 room14 room13)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room13)
   goals met: 16 of 20
66. (drop robot1 ball16 room14 lgripper1)
   deleted: (carry robot1 ball16 lgripper1)
   added: (at ball16 room14) (free robot1 lgripper1)
   goals met: 17 of 20
67. (drop robot3 ball11 room13 lgripper3)
   deleted: (carry robot3 ball11 lgripper3)
   added: (at ball11 room13) (free robot3 lgripper3)
   goals met: 18 of 20
68. (pick robot3 ball19 room13 rgripper3)
   deleted: (at ball19 room13) (free robot3 rgripper3)
   added: (carry robot3 ball19 rgripper3)
   goals met: 18 of 20
69. (move robot2 room12 room2)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room2)
   goals met: 18 of 20
70. (pick robot3 ball15 room13 lgripper3)
   deleted: (at ball15 room13) (free robot3 lgripper3)
   added: (carry robot3 ball15 lgripper3)
   goals met: 18 of 20
71. (move robot3 room13 room22)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room22)
   goals met: 18 of 20
72. (drop robot3 ball19 room22 rgripper3)
   deleted: (carry robot3 ball19 rgripper3)
   added: (at ball19 room22) (free robot3 rgripper3)
   goals met: 19 of 20
73. (move robot3 room22 room2)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room2)
   goals met: 19 of 20
74. (drop robot3 ball15 room2 lgripper3)
   deleted: (carry robot3 ball15 lgripper3)
   added: (at ball15 room2) (free robot3 lgripper3)
   goals met: 20 of 20
